namespace RisingNotesLib.Constant;

public static class ServiceConstant
{
    /// <summary>
    /// Список жанров
    /// </summary>
    public static HashSet<string> GenreList { get; } = new()
    {
        "Рок",
        "Поп",
        "Рэп & Хип-Хоп",
        "Для легкого прослушивания",
        "Хаус & танцевальная музыка",
        "Инструментальная",
        "Метал",
        "Альтернативная",
        "Дабстеп",
        "Транс",
        "Шансон",
        "Этническая",
        "Акустическая музыка & вокал",
        "Регги",
        "Классическая музыка",
        "Инди-Поп",
        "Электропоп & Диско",
        "Другое"
    };

    /// <summary>
    /// Список настроений
    /// </summary>
    public static HashSet<string> VibeList { get; } = new()
    {
        "Агрессивное",
        "Грустное",
        "Красивое",
        "Лето",
        "Мистическое",
        "Новый год",
        "Радостное",
        "Сентиментальное",
        "Энергичное",
        "Весеннее",
        "Зимнее",
        "Крутое",
        "Мечтательное",
        "Мрачное",
        "Осеннее",
        "Отдыхаю",
        "Спокойное",
        "Эпичное"
    };

    /// <summary>
    /// Список языков
    /// </summary>
    public static HashSet<string> LanguageList { get; } = new()
    {
        "Азербайджанский",
        "Нидерландский",
        "Албанский",
        "Норвежский",
        "Английский",
        "Персидский",
        "Арабский",
        "Польский",
        "Армянский",
        "Португальский",
        "Белорусский",
        "Румынский",
        "Болгарский",
        "Русский",
        "Венгерский",
        "Сербский",
        "Вьетнамский",
        "Словацкий",
        "Голландский",
        "Словенский",
        "Древнегреческий",
        "Таджикский",
        "Греческий",
        "Тайский",
        "Грузинский",
        "Татарский",
        "Дари",
        "Турецкий",
        "Датский",
        "Туркменский",
        "Иврит",
        "Украинский",
        "Испанский",
        "Узбекский",
        "Итальянский",
        "Фарси",
        "Кыргызский",
        "Финский",
        "Казахский",
        "Фламандский",
        "Китайский",
        "Французский",
        "Корейский",
        "Хинди",
        "Латинский",
        "Хорватский",
        "Латышский",
        "Чешский",
        "Литовский",
        "Шведский",
        "Малазийский",
        "Эстонский",
        "Молдавский",
        "Японский",
        "Монгольский",
        "Немецкий",
        "Непальский"
    };
}